Revit 2027 API
BuiltInFailures.StairRampFailures.ContinuousRailGometryCreationFailure Property
 Cannot create the continuous rail geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ContinuousRailGometryCreationFailure { get; }
Public Shared ReadOnly Property ContinuousRailGometryCreationFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ContinuousRailGometryCreationFailure {
	FailureDefinitionId^ get ();
}
static member ContinuousRailGometryCreationFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace